{
  "_name_or_path": "InstaDeepAI/nucleotide-transformer-v2-50m-multi-species",
  "add_bias_fnn": false,
  "architectures": [
    "EsmForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "auto_map": {
    "AutoConfig": "InstaDeepAI/nucleotide-transformer-v2-50m-multi-species--esm_config.EsmConfig",
    "AutoModelForMaskedLM": "InstaDeepAI/nucleotide-transformer-v2-50m-multi-species--modeling_esm.EsmForMaskedLM",
    "AutoModelForSequenceClassification": "InstaDeepAI/nucleotide-transformer-v2-50m-multi-species--modeling_esm.EsmForSequenceClassification",
    "AutoModelForTokenClassification": "InstaDeepAI/nucleotide-transformer-v2-50m-multi-species--modeling_esm.EsmForTokenClassification"
  },
  "emb_layer_norm_before": false,
  "esmfold_config": null,
  "hidden_dropout_prob": 0.0,
  "hidden_size": 512,
  "id2label": {
    "0": "LABEL_0",
    "1": "LABEL_1",
    "2": "LABEL_2",
    "3": "LABEL_3",
    "4": "LABEL_4",
    "5": "LABEL_5",
    "6": "LABEL_6",
    "7": "LABEL_7",
    "8": "LABEL_8",
    "9": "LABEL_9",
    "10": "LABEL_10",
    "11": "LABEL_11",
    "12": "LABEL_12",
    "13": "LABEL_13",
    "14": "LABEL_14",
    "15": "LABEL_15"
  },
  "initializer_range": 0.02,
  "intermediate_size": 2048,
  "is_folding_model": false,
  "label2id": {
    "LABEL_0": 0,
    "LABEL_1": 1,
    "LABEL_10": 10,
    "LABEL_11": 11,
    "LABEL_12": 12,
    "LABEL_13": 13,
    "LABEL_14": 14,
    "LABEL_15": 15,
    "LABEL_2": 2,
    "LABEL_3": 3,
    "LABEL_4": 4,
    "LABEL_5": 5,
    "LABEL_6": 6,
    "LABEL_7": 7,
    "LABEL_8": 8,
    "LABEL_9": 9
  },
  "layer_norm_eps": 1e-12,
  "mask_token_id": 2,
  "max_position_embeddings": 2050,
  "model_type": "esm",
  "num_attention_heads": 16,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "position_embedding_type": "rotary",
  "problem_type": "single_label_classification",
  "tie_word_embeddings": false,
  "token_dropout": false,
  "torch_dtype": "float32",
  "transformers_version": "4.42.4",
  "use_cache": false,
  "vocab_list": null,
  "vocab_size": 4107
}
